{"books": [{"key": "/works/OL2534960W", "title": "V for Vendetta", "year": 2006, "author": "Steve Moore", "genre": "Politics and government", "image": "https://covers.openlibrary.org/b/id/540094-L.jpg", "description": "Great Book!"}, {"key": "/works/OL5045596W", "title": "Banned books", "year": 1994, "author": "Robert P. Doyle", "genre": "Prohibited books", "image": "https://covers.openlibrary.org/b/id/5143143-L.jpg", "description": "Great Book!"}, {"key": "/works/OL17843967W", "title": "Everything, Everything", "year": 2015, "author": "Nicola Yoon, Eric Chevreau (Traduction)", "genre": "Chronically ill children", "image": "https://covers.openlibrary.org/b/id/8140499-L.jpg", "description": "The story of a teenage girl who's literally allergic to the outside world. When a new family moves in next door, she begins a complicated romance that challenges everything she's ever known. The narrative unfolds via vignettes, diary entries, texts, charts, lists, illustrations, and more."}, {"key": "/works/OL20009530W", "title": "Out of darkness", "year": 2015, "author": "Ashley Hope Pérez", "genre": "Race relations", "image": "https://covers.openlibrary.org/b/id/10240631-L.jpg", "description": "Out of Darkness is a work of historical young adult fiction, loosely based on an actual school explosion that took place in New London, Texas, in 1937.   Ashley Hope Perez has taken the explosion as her backdrop and imagined a diverse cast of characters whose broken lives are utterly captivating and tragically entangled with the school and the explosion. The central story is that of two teenagers: Naomi, who is Mexican, and Wash, who is black. It's a gripping novel about race, segregation, love, and the forces that destroy people. Author Biography."}, {"key": "/works/OL1835957W", "title": "Fun Home", "year": 2006, "author": "Alison Bechdel, ALISON BECHDEL, Alison Bechdel", "genre": "Cartoonists", "image": "https://covers.openlibrary.org/b/id/12366765-L.jpg", "description": "A fresh and brilliantly told memoir from a cult favorite comic artist, marked by gothic twists, a family funeral home, sexual angst, and great books."}, {"key": "/works/OL16793507W", "title": "Drama", "year": 2012, "author": "Raina Telgemeier", "genre": "Children's fiction", "image": "https://covers.openlibrary.org/b/id/12360868-L.jpg", "description": "Callie loves theater. And while she would totally try out for her middle school's production of Moon over Mississippi, she can't really sing. Instead she's the set designer for the drama department's stage crew, and this year she's determined to create a set worthy of Broadway on a middle-school budget. But how can she, when she doesn't know much about carpentry, ticket sales are down, and the crew members are having trouble working together? Not to mention the onstage AND offstage drama that occurs once the actors are chosen. And when two cute brothers enter the picture, things get even crazier!"}, {"key": "/works/OL16803752W", "title": "Eleanor & Park", "year": 2012, "author": "Rainbow Rowell", "genre": "Love & Romance", "image": "https://covers.openlibrary.org/b/id/12701134-L.jpg", "description": "## Two misfits. One extraordinary love. ##"}, {"key": "/works/OL81977W", "title": "Protect and Defend", "year": 1000, "author": "Richard North Patterson, Richard North Patterson, R N Patterson", "genre": "Judges", "image": "https://covers.openlibrary.org/b/id/9868894-L.jpg", "description": "On a cold day in January President Kerry Kilcannon takes the oath of office-- and within days makes his first, most important move: appointing a new Chief Justice of the Supreme Court. Kilcannon's choice is a female judge with a brilliant record. And a secret. While the Senate spars over Caroline Masters' nomination, an inflammatory abortion rights case is making its way toward the judge--and will explode into the headlines. Suddenly, the most divisive issue in America turns the President's nomination into all-out war. And from Judge Masters to a conservative, war-hero senator facing a crisis of conscience and a fifteen-year-old girl battling for her future, no one will be safe. Protect and Defend takes us on a riveting journey between what is legal, what is right . . . and the price of finally knowing the difference."}, {"key": "/works/OL18021055W", "title": "Autoboyography", "year": 2017, "author": "Christina Lauren", "genre": "Families", "image": "https://covers.openlibrary.org/b/id/12354361-L.jpg", "description": "Three years ago, Tanner Scott’s family relocated from California to Utah, a move that nudged the bisexual teen temporarily back into the closet. Now, with one semester of high school to go, and no obstacles between him and out-of-state college freedom, Tanner plans to coast through his remaining classes and clear out of Utah."}, {"key": "/works/OL19968347W", "title": "The infinite moment of us", "year": 2013, "author": "Lauren Myracle", "genre": "Love", "image": "https://covers.openlibrary.org/b/id/9960403-L.jpg", "description": "As high school graduation nears, Wren Gray is surprised to connect with gentle Charlie Parker, a boy with a troubled past who has loved her for years, while she considers displeasing her parents for the first time and changing the plans for her future."}, {"key": "/works/OL17530849W", "title": "Five, Six, Seven, Nate!", "year": 2014, "author": "Tim Federle", "genre": "Theater", "image": "https://covers.openlibrary.org/b/id/7763353-L.jpg", "description": "Armed with a one-way ticket to New York City, small-town theater geek Nate is off to start rehearsals for E.T.: The Broadway Musical. It’s everything he ever practiced his autograph for! But as thrilling as Broadway is, rehearsals are nothing like Nate expects: full of intimidating child stars, cut-throat understudies, and a director who can’t even remember Nate’s name."}, {"key": "/works/OL16167575W", "title": "Banned books", "year": 2012, "author": "Cynthia A. Bily", "genre": "Prohibited books", "image": "https://covers.openlibrary.org/b/id/12760088-L.jpg", "description": "\"Banned Books: Should Children Be Protected from Controversial Books?; Should Certain Kinds of Material Be Restricted?; What Are Some Alternatives to Banning Controversial Books?\"--"}, {"key": "/works/OL47292W", "title": "Push", "year": 1996, "author": "Sapphire, Tayari Jones", "genre": "Child abuse", "image": "https://covers.openlibrary.org/b/id/418593-L.jpg", "description": "Precious Jones, an illiterate sixteen-year-old, has up until now been invisible: invisible to the father who rapes her and the mother who batters her and to the authorities who dismiss her as just one more of Harlem's casualties. But when Precious, pregnant with a second child by her father, meets a determined and highly radical teacher, we follow her on a journey of education and enlightenment as Precious learns not only how to write about her life, but how to make it her own for the first time"}, {"key": "/works/OL19754790W", "title": "Heavy", "year": 2018, "author": "Kiese Laymon", "genre": "Patients", "image": "https://covers.openlibrary.org/b/id/12366762-L.jpg", "description": "\"Laymon writes eloquently and honestly about the physical manifestations of violence, grief, trauma, and abuse on his own body. He writes of his own eating disorder and gambling addiction as well as similar issues that run throughout his family. Through self-exploration, storytelling, and honest conversation with family and friends, Heavy seeks to bring what has been hidden into the light and to reckon with all of its myriad sources, from the most intimate--a mother-child relationship--to the most universal--a society that has undervalued and abused black bodies for centuries\"--"}, {"key": "/works/OL15473024W", "title": "Gay issues and politics", "year": 2011, "author": "Jaime Seba", "genre": "Discrimination", "image": "https://covers.openlibrary.org/b/id/12364090-L.jpg", "description": "Great Book!"}, {"key": "/works/OL20004466W", "title": "More happy than not", "year": 2015, "author": "Adam Silvera", "genre": "Dating (Social customs)", "image": "https://covers.openlibrary.org/b/id/12357256-L.jpg", "description": "When it first gets announced, the Leteo Institute's memory-alteration procedure seems too good to be true to Aaron Soto-miracle cure-alls don't tend to pop up in the Bronx projects. Aaron can't forget how he's grown up poor, how his friends all seem to shrug him off, and how his father committed suicide in their one bedroom apartment. He has the support of his patient girlfriend, if not necessarily his distant brother and overworked mother, but it's not enough. Then Thomas shows up. He doesn't mind Aaron's obsession over the Scorpius Hawthorne books and has a sweet movie set-up on his roof. There are nicknames. Aaron's not only able to be himself, but happiness feels easy with Thomas. The love Aaron discovers may cost him what's left of his life, but since Aaron can't suddenly stop being gay Leteo may be the only way out."}, {"key": "/works/OL46760W", "title": "The Glass Castle", "year": 2005, "author": "Jeannette Walls, Jeannette Walls", "genre": "Poor", "image": "https://covers.openlibrary.org/b/id/11517692-L.jpg", "description": "A story about the early life of Jeannette Walls. The memoir is an exposing work about her early life and growing up on the run and often homeless. It presents a different perspective of life from all over the United States and the struggle a girl had to find normalcy as she grew into an adult."}, {"key": "/works/OL5709938W", "title": "And Tango Makes Three", "year": 2005, "author": "Justin Richardson, Peter Parnell, Justin RICHARDSON, Peter PARNELL", "genre": "Juvenile fiction", "image": "https://covers.openlibrary.org/b/id/12356124-L.jpg", "description": "In the zoo there are all kinds of animal families. But Tango's family is not like any of the others. This illustrated children's book fictionalizes the true story of two male penguins who became partners and raised a penguin chick in the Central Park Zoo."}, {"key": "/works/OL1838412W", "title": "Then Again, Maybe I Won't", "year": 1971, "author": "Judy Blume", "genre": "Emotional problems", "image": "https://covers.openlibrary.org/b/id/10094929-L.jpg", "description": "Unable to accept or explain his family's newly acquired wealth, his growing interest in sex, and a friend's shoplifting habit, a thirteen-year-old finds the pains in his stomach getting worse and worse"}, {"key": "/works/OL447678W", "title": "47", "year": 2005, "author": "Walter Mosley, Walter Mosley, Ossie Davis", "genre": "Magic", "image": "https://covers.openlibrary.org/b/id/8303869-L.jpg", "description": "Walter Mosley is one of the best-known writers in America. In his first book for young adults, Mosley deftly weaves historical and speculative fiction into a powerful narrative about the nature of freedom. 47 is a young slave boy living under the watchful eye of a brutal slave master. His life seems doomed until he meets a mysterious runaway slave, Tall John. Then, 47 finds himself swept up in a struggle for his own liberation."}]}